Repository: samszo/DesignEdition-ELO17
Catalog: os/modules/omeka-s-module-PslSearchForm-master/language/*.po
Languages: fr

source: Search
fr: Recherche

source: From year
fr: Depuis l'année

source: To year
fr: À l'année

source: Creation year
fr: Année de création

source: YYYY
fr: AAAA

source: Is Public field
fr: Champ 'est publique'

source: None
fr: Aucun

source: Date range field
fr: Champ 'intervalle de date'

source: Item set id field
fr: Champ 'identifiants de collections'

source: Creation year field
fr: Champ 'année de création'

source: Spatial coverage field
fr: Champ 'couverture spatiale'

source: Advanced search fields
fr: Champs de recherche avancée

source: Enabled
fr: Activé

source: Weight
fr: Poids

source: Locations
fr: Lieux

source: New search
fr: Nouvelle recherche

source: Location
fr: Lieu

source: Time period
fr: Période temporelle

source: More
fr: Plus

source: Reset
fr: Réinitialiser

source: 14th century
fr: XIVe siècle

source: 15th
fr: XVe

source: 16th
fr: XVIe

source: 17th
fr: XVIIe

source: 18th
fr: XVIIIe

source: 19th
fr: XIXe

source: 20th
fr: XXe

source: 21th century
fr: XXIe siècle
